### Pandas continued

See chapter 5 of Wes McKinney Python for Data Analysis

https://wesmckinney.com/book/pandas-basics.html#pandas_construction

### DataFrame

A DataFrame is like an excel spreadsheet, i.e. 2D object

- column names are in a list called `columns`
- rows or names of rows are in a list called `index` (not rows)
- if you construct a DataFrame from a dictionary, the **keys** of the dictionary become **column** names, not row names

In [164]:
import pandas as pd
import numpy as np

matrix=np.arange(12).reshape(3,4)
print(matrix)

[[ 0  1  2  3]
 [ 4  5  6  7]
 [ 8  9 10 11]]

In [165]:
df=pd.DataFrame(matrix, columns=['A', 'B', 'C', 'D'], index=[2, 'row2', 'row3'])

In [166]:
df

      A  B   C   D
2     0  1   2   3
row2  4  5   6   7
row3  8  9  10  11

In [167]:
df['A']

2       0
row2    4
row3    8
Name: A, dtype: int64

In [169]:
df['row1'] #gives error, must use loc and iloc for rows!

KeyError: 'row1'

In [ ]:
df

      A  B   C   D
2     0  1   2   3
row2  4  5   6   7
row3  8  9  10  11

In [ ]:
df.index

Index([2, 'row2', 'row3'], dtype='object')

In [ ]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [ ]:
df.loc[2]

A    0
B    1
C    2
D    3
Name: 2, dtype: int64

In [ ]:
df.iloc[0]  #iloc is `integer locate', python counting starts at 0

A    0
B    1
C    2
D    3
Name: 2, dtype: int64

### Deleting a row or column:

use `.drop(column=[])` for dropping columns 

or `.drop(index=[])` for dropping rows (index means rows)

In [ ]:
df

      A  B   C   D
2     0  1   2   3
row2  4  5   6   7
row3  8  9  10  11

In [ ]:
df.drop(columns=['A'])

      B   C   D
2     1   2   3
row2  5   6   7
row3  9  10  11

In [ ]:
df

      A  B   C   D
2     0  1   2   3
row2  4  5   6   7
row3  8  9  10  11

Notice above that column A has not been deleted from `df` because the `drop` operation first creates a **copy** of `df`, from which it deletes the column, and it does not act on `df`. But you want it to delete the column in your original DataFrame, use `inplace=True` as below:

In [ ]:
df.drop(columns=['A'], inplace=True)

In [ ]:
df

      B   C   D
2     1   2   3
row2  5   6   7
row3  9  10  11

In [ ]:
# delete row2
df.drop(index=['row2'])

      B   C   D
2     1   2   3
row3  9  10  11

### Replacing a column

In [ ]:
df

      B   C   D
2     1   2   3
row2  5   6   7
row3  9  10  11

In [ ]:
df['B']=[2,3, 4]

In [ ]:
df

      B   C   D
2     2   2   3
row2  3   6   7
row3  4  10  11

###  Replacing a row

In [ ]:
df.loc['row2']=[20,20,20]

In [ ]:
df

       B   C   D
2      2   2   3
row2  20  20  20
row3   4  10  11

# Filtering based on value of a column

Suppose we want all rows where value in column C is >5.

First create a true-false 'mask':

In [ ]:
df

       B   C   D
2      2   2   3
row2  20  20  20
row3   4  10  11

In [ ]:
df['C']>5

2       False
row2     True
row3     True
Name: C, dtype: bool

In [ ]:
df[df['C']>5]

       B   C   D
row2  20  20  20
row3   4  10  11

In [ ]:
mask=df['C']>5
df[mask]

       B   C   D
row2  20  20  20
row3   4  10  11

In [ ]:
df

       B   C   D
2      2   2   3
row2  20  20  20
row3   4  10  11

In [ ]:
mask2=df['B']<=4

In [ ]:
mask2

2        True
row2    False
row3     True
Name: B, dtype: bool

In [ ]:
df[mask2]

      B   C   D
2     2   2   3
row3  4  10  11

Adding two dataframes with possibly some different columns or indexes is possible, will just introduce `NaN`s in appropriate places. This example is copied from McKinney section 5.2:

In [ ]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"),
   .....:                    index=["Ohio", "Texas", "Colorado"])

df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),
   .....:                    index=["Utah", "Ohio", "Texas", "Oregon"])

In [ ]:
df1, df2

(            b    c    d
 Ohio      0.0  1.0  2.0
 Texas     3.0  4.0  5.0
 Colorado  6.0  7.0  8.0,
           b     d     e
 Utah    0.0   1.0   2.0
 Ohio    3.0   4.0   5.0
 Texas   6.0   7.0   8.0
 Oregon  9.0  10.0  11.0)

In [ ]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

### Applying functions to entries of a data frame

In [ ]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [ ]:
np.square(df1)  #vectorized numpy operations accept dataframes as input

             b     c     d
Ohio       0.0   1.0   4.0
Texas      9.0  16.0  25.0
Colorado  36.0  49.0  64.0

### Apply a function to rows or columns

syntax

`.apply`

`<dataframe>.apply(function, axis=)`

In [ ]:
def my_function(x):
    return x**2

df=df.apply(my_function)
df

           B       C       D
2         16      16      81
row2  160000  160000  160000
row3     256   10000   14641

In [ ]:
df

           B       C       D
2         16      16      81
row2  160000  160000  160000
row3     256   10000   14641

In [ ]:
#replace just column B with it entries squares
df['B']=df['B'].apply(my_function)

In [ ]:
df

                B       C       D
2             256      16      81
row2  25600000000  160000  160000
row3        65536   10000   14641

In [ ]:
df.loc[2]=df.loc[2].apply(my_function)

In [ ]:
df

                B       C       D
2           65536     256    6561
row2  25600000000  160000  160000
row3        65536   10000   14641

In [ ]:
df.iloc[2]=df.iloc[2].apply(my_function)

In [ ]:
df

                B          C          D
2           65536        256       6561
row2  25600000000     160000     160000
row3   4294967296  100000000  214358881

### Sorting

Can sort index, but I think more common is to sort the values:

In [ ]:
df

                B          C          D
2           65536        256       6561
row2  25600000000     160000     160000
row3   4294967296  100000000  214358881

In [ ]:
df.sort_values(by=['B'])

                B          C          D
2           65536        256       6561
row3   4294967296  100000000  214358881
row2  25600000000     160000     160000

In [ ]:
df

                B          C          D
2           65536        256       6561
row2  25600000000     160000     160000
row3   4294967296  100000000  214358881

In [ ]:
df.sort_values(by=['D','B'])

                B          C          D
2           65536        256       6561
row2  25600000000     160000     160000
row3   4294967296  100000000  214358881

In [ ]:
df

                B          C          D
2           65536        256       6561
row2  25600000000     160000     160000
row3   4294967296  100000000  214358881

[rows, columns]

In [ ]:
df.sum(axis=0)

B    29895032832
C      100160256
D      214525442
dtype: int64

### Axis, again

Yesterday I said (correctly)

### axis=0 means varying rows, keeping column fixed

I wrote 
### axis=0 means columns
but I should have written more precisely
### axis=0 means (operation is applied to) columns

and while correct, the usage in Pandas/McKinney is that axis means direction 

`axis=0` is `axis="rows"`
because if you say sum in the direction of rows axis, you are summing up to columns.

And
`axis=1` is synonymous with `axis="columns"`
since doing a sum along the direction of the columns axis is summing each row.

Very confusing, I'm sorry.

In [ ]:
df

                B          C          D
2           65536        256       6561
row2  25600000000     160000     160000
row3   4294967296  100000000  214358881

In [ ]:

df.sum(axis=0)

B    29895032832
C      100160256
D      214525442
dtype: int64

In [ ]:
df.sum(axis='index')

B    29895032832
C      100160256
D      214525442
dtype: int64

In [ ]:
#the following command sums the ROWS
df.sum(axis='columns')

2             72353
row2    25600320000
row3     4609326177
dtype: int64

###  concat

pd.concat?

In [ ]:
pd.concat?

Signature:
pd.concat(
    objs: 'Iterable[NDFrame] | Mapping[HashableT, NDFrame]',
    *,
    axis: 'Axis' = 0,
    join: 'str' = 'outer',
    ignore_index: 'bool' = False,
    keys=None,
    levels=None,
    names=None,
    verify_integrity: 'bool' = False,
    sort: 'bool' = False,
    copy: 'bool | None' = None,
) -> 'DataFrame | Series'
Docstring:
Concatenate pandas objects along a particular axis.

Allows optional set logic along the other axes.

Can also add a layer of hierarchical indexing on the concatenation axis,
which may be useful if the labels are the same (or overlapping) on
the passed axis number.

Parameters
----------
objs : a sequence or mapping of Series or DataFrame objects
    If a mapping is passed, the sorted keys will be used as the `keys`
    argument, unless it is passed, in which case the values will be
    selected (see below). Any None objects will be dropped silently unless
    they are all None in which case a ValueError will be raised.
axis : {0/'index', 1/'columns'}, default 0
    The axis to concatenate along.
join : {'inner', 'outer'}, default 'outer'
    How to handle indexes on other axis (or axes).
ignore_index : bool, default False
    If True, do not use the index values along the concatenation axis. The
    resulting axis will be labeled 0, ..., n - 1. This is useful if you are
    concatenating objects where the concatenation axis does not have
    meaningful indexing information. Note the index values on the other
    axes are still respected in the join.
keys : sequence, default None
    If multiple levels passed, should contain tuples. Construct
    hierarchical index using the passed keys as the outermost level.
levels : list of sequences, default None
    Specific levels (unique values) to use for constructing a
    MultiIndex. Otherwise they will be inferred from the keys.
names : list, default None
    Names for the levels in the resulting hierarchical index.
verify_integrity : bool, default False
    Check whether the new concatenated axis contains duplicates. This can
    be very expensive relative to the actual data concatenation.
sort : bool, default False
    Sort non-concatenation axis if it is not already aligned.

copy : bool, default True
    If False, do not copy data unnecessarily.

Returns
-------
object, type of objs
    When concatenating all ``Series`` along the index (axis=0), a
    ``Series`` is returned. When ``objs`` contains at least one
    ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
    the columns (axis=1), a ``DataFrame`` is returned.

See Also
--------
DataFrame.join : Join DataFrames using indexes.
DataFrame.merge : Merge DataFrames by indexes or columns.

Notes
-----
The keys, levels, and names arguments are all optional.

A walkthrough of how this method fits in with other tools for combining
pandas objects can be found `here
<https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

It is not recommended to build DataFrames by adding single rows in a
for loop. Build a list of rows and make a DataFrame in a single concat.

Examples
--------
Combine two ``Series``.

>>> s1 = pd.Series(['a', 'b'])
>>> s2 = pd.Series(['c', 'd'])
>>> pd.concat([s1, s2])
0    a
1    b
0    c
1    d
dtype: object

Clear the existing index and reset it in the result
by setting the ``ignore_index`` option to ``True``.

>>> pd.concat([s1, s2], ignore_index=True)
0    a
1    b
2    c
3    d
dtype: object

Add a hierarchical index at the outermost level of
the data with the ``keys`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'])
s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

Label the index keys you create with the ``names`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'],
...           names=['Series name', 'Row ID'])
Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

Combine two ``DataFrame`` objects with identical columns.

>>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
...                    columns=['letter', 'number'])
>>> df1
  letter  number
0      a       1
1      b       2
>>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
...                    columns=['letter', 'number'])
>>> df2
  letter  number
0      c       3
1      d       4
>>> pd.concat([df1, df2])
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects with overlapping columns
and return everything. Columns outside the intersection will
be filled with ``NaN`` values.

>>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
...                    columns=['letter', 'number', 'animal'])
>>> df3
  letter  number animal
0      c       3    cat
1      d       4    dog
>>> pd.concat([df1, df3], sort=False)
  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

Combine ``DataFrame`` objects with overlapping columns
and return only those that are shared by passing ``inner`` to
the ``join`` keyword argument.

>>> pd.concat([df1, df3], join="inner")
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects horizontally along the x axis by
passing in ``axis=1``.

>>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
...                    columns=['animal', 'name'])
>>> pd.concat([df1, df4], axis=1)
  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

Prevent the result from including duplicate index values with the
``verify_integrity`` option.

>>> df5 = pd.DataFrame([1], index=['a'])
>>> df5
   0
a  1
>>> df6 = pd.DataFrame([2], index=['a'])
>>> df6
   0
a  2
>>> pd.concat([df5, df6], verify_integrity=True)
Traceback (most recent call last):
    ...
ValueError: Indexes have overlapping values: ['a']

Append a single row to the end of a ``DataFrame`` object.

>>> df7 = pd.DataFrame({'a': 1, 'b': 2}, index=[0])
>>> df7
    a   b
0   1   2
>>> new_row = pd.Series({'a': 3, 'b': 4})
>>> new_row
a    3
b    4
dtype: int64
>>> pd.concat([df7, new_row.to_frame().T], ignore_index=True)
    a   b
0   1   2
1   3   4
File:      ~/.pyenv/versions/3.11.4/envs/2521_env/lib/python3.11/site-packages/pandas/core/reshape/concat.py
Type:      function

In [ ]:
df1, df2

(            b    c    d
 Ohio      0.0  1.0  2.0
 Texas     3.0  4.0  5.0
 Colorado  6.0  7.0  8.0,
           b     d     e
 Utah    0.0   1.0   2.0
 Ohio    3.0   4.0   5.0
 Texas   6.0   7.0   8.0
 Oregon  9.0  10.0  11.0)

In [ ]:
pd.concat([df1, df2])  #default axis=0 i.e. rows

            b    c     d     e
Ohio      0.0  1.0   2.0   NaN
Texas     3.0  4.0   5.0   NaN
Colorado  6.0  7.0   8.0   NaN
Utah      0.0  NaN   1.0   2.0
Ohio      3.0  NaN   4.0   5.0
Texas     6.0  NaN   7.0   8.0
Oregon    9.0  NaN  10.0  11.0

In [ ]:
df1, df2

(            b    c    d
 Ohio      0.0  1.0  2.0
 Texas     3.0  4.0  5.0
 Colorado  6.0  7.0  8.0,
           b     d     e
 Utah    0.0   1.0   2.0
 Ohio    3.0   4.0   5.0
 Texas   6.0   7.0   8.0
 Oregon  9.0  10.0  11.0)

In [ ]:
pd.concat([df1, df2], axis=1)

            b    c    d    b     d     e
Ohio      0.0  1.0  2.0  3.0   4.0   5.0
Texas     3.0  4.0  5.0  6.0   7.0   8.0
Colorado  6.0  7.0  8.0  NaN   NaN   NaN
Utah      NaN  NaN  NaN  0.0   1.0   2.0
Oregon    NaN  NaN  NaN  9.0  10.0  11.0

In [ ]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

## McKinney Chapter 10 Group operations
### groupby
### split-apply-combine paradigm

 - split the rows
 - apply a function
 - combine the results

https://wesmckinney.com/book/data-aggregation.html?q=groupby#groupby_fundamentals

In [ ]:
# example from McKinney Chapter 10

df = pd.DataFrame({"key1" : ["a", "a", None, "b", "b", "a", None],
                 "key2" : pd.Series([1, 2, 1, 2, 1, None, 1],
                                     dtype="Int64"),
                 "data1" : np.random.standard_normal(7),
                  "data2" : np.random.standard_normal(7)})

In [ ]:
df

   key1  key2     data1     data2
0     a     1 -0.771237 -0.684660
1     a     2  0.388218  0.313966
2  None     1 -0.072378  0.668783
3     b     2 -0.294783 -1.224849
4     b     1 -0.028292 -1.321189
5     a  <NA>  0.891031 -0.287722
6  None     1 -0.008635  0.096108

In [ ]:
grouped = df["data1"].groupby(df["key1"])  #split by key1 value
grouped

In [ ]:
grouped.sum()  #apply the sum function

key1
a    0.508013
b   -0.323075
Name: data1, dtype: float64

# Week 3 video
HW: Go through one of the examples in Chapter 13
and make an 5-10 min instructional video

https://wesmckinney.com/book/data-analysis-examples

Github Datasets:

https://github.com/wesm/pydata-book

Download to your local device, know where you save it

In [ ]:
import json

In [ ]:
db = json.load(open("database.json"))

In [ ]:
!ls  #windows: !dir

2521_Syllabus.md                chapter4notes.ipynb
Exercise112.py                  chapter5notes.ipynb
PythonNotesForProfessionals.pdf chapter5notes_day2.ipynb
README.md                       chapter7notes.ipynb
__pycache__                     chapter8notes.ipynb
chapter10notes.ipynb            database.json
chapter10notes_day2.ipynb       my_figure.pdf
chapter1notes.ipynb             my_filename
chapter2notes.ipynb             test.csv
chapter3notes.ipynb             test1.txt
chapter3notes_day2.ipynb        text-to-image.ipynb

In [ ]:
len(db)

6636

In [163]:
db[0]  # this is a dictionary

{'id': 1008,
 'description': 'Cheese, caraway',
 'tags': [],
 'manufacturer': '',
 'group': 'Dairy and Egg Products',
 'portions': [{'amount': 1, 'unit': 'oz', 'grams': 28.35}],
 'nutrients': [{'value': 25.18,
   'units': 'g',
   'description': 'Protein',
   'group': 'Composition'},
  {'value': 29.2,
   'units': 'g',
   'description': 'Total lipid (fat)',
   'group': 'Composition'},
  {'value': 3.06,
   'units': 'g',
   'description': 'Carbohydrate, by difference',
   'group': 'Composition'},
  {'value': 3.28, 'units': 'g', 'description': 'Ash', 'group': 'Other'},
  {'value': 376.0,
   'units': 'kcal',
   'description': 'Energy',
   'group': 'Energy'},
  {'value': 39.28,
   'units': 'g',
   'description': 'Water',
   'group': 'Composition'},
  {'value': 1573.0, 'units': 'kJ', 'description': 'Energy', 'group': 'Energy'},
  {'value': 0.0,
   'units': 'g',
   'description': 'Fiber, total dietary',
   'group': 'Composition'},
  {'value': 673.0,
   'units': 'mg',
   'description': 'Calcium, Ca',
   'group': 'Elements'},
  {'value': 0.64,
   'units': 'mg',
   'description': 'Iron, Fe',
   'group': 'Elements'},
  {'value': 22.0,
   'units': 'mg',
   'description': 'Magnesium, Mg',
   'group': 'Elements'},
  {'value': 490.0,
   'units': 'mg',
   'description': 'Phosphorus, P',
   'group': 'Elements'},
  {'value': 93.0,
   'units': 'mg',
   'description': 'Potassium, K',
   'group': 'Elements'},
  {'value': 690.0,
   'units': 'mg',
   'description': 'Sodium, Na',
   'group': 'Elements'},
  {'value': 2.94,
   'units': 'mg',
   'description': 'Zinc, Zn',
   'group': 'Elements'},
  {'value': 0.024,
   'units': 'mg',
   'description': 'Copper, Cu',
   'group': 'Elements'},
  {'value': 0.021,
   'units': 'mg',
   'description': 'Manganese, Mn',
   'group': 'Elements'},
  {'value': 14.5,
   'units': 'mcg',
   'description': 'Selenium, Se',
   'group': 'Elements'},
  {'value': 1054.0,
   'units': 'IU',
   'description': 'Vitamin A, IU',
   'group': 'Vitamins'},
  {'value': 262.0,
   'units': 'mcg',
   'description': 'Retinol',
   'group': 'Vitamins'},
  {'value': 271.0,
   'units': 'mcg_RAE',
   'description': 'Vitamin A, RAE',
   'group': 'Vitamins'},
  {'value': 0.0,
   'units': 'mg',
   'description': 'Vitamin C, total ascorbic acid',
   'group': 'Vitamins'},
  {'value': 0.031,
   'units': 'mg',
   'description': 'Thiamin',
   'group': 'Vitamins'},
  {'value': 0.45,
   'units': 'mg',
   'description': 'Riboflavin',
   'group': 'Vitamins'},
  {'value': 0.18, 'units': 'mg', 'description': 'Niacin', 'group': 'Vitamins'},
  {'value': 0.19,
   'units': 'mg',
   'description': 'Pantothenic acid',
   'group': 'Vitamins'},
  {'value': 0.074,
   'units': 'mg',
   'description': 'Vitamin B-6',
   'group': 'Vitamins'},
  {'value': 18.0,
   'units': 'mcg',
   'description': 'Folate, total',
   'group': 'Vitamins'},
  {'value': 0.27,
   'units': 'mcg',
   'description': 'Vitamin B-12',
   'group': 'Vitamins'},
  {'value': 0.0,
   'units': 'mcg',
   'description': 'Folic acid',
   'group': 'Vitamins'},
  {'value': 18.0,
   'units': 'mcg',
   'description': 'Folate, food',
   'group': 'Vitamins'},
  {'value': 18.0,
   'units': 'mcg_DFE',
   'description': 'Folate, DFE',
   'group': 'Vitamins'},
  {'value': 93.0,
   'units': 'mg',
   'description': 'Cholesterol',
   'group': 'Other'},
  {'value': 18.584,
   'units': 'g',
   'description': 'Fatty acids, total saturated',
   'group': 'Other'},
  {'value': 8.275,
   'units': 'g',
   'description': 'Fatty acids, total monounsaturated',
   'group': 'Other'},
  {'value': 0.83,
   'units': 'g',
   'description': 'Fatty acids, total polyunsaturated',
   'group': 'Other'},
  {'value': 0.324,
   'units': 'g',
   'description': 'Tryptophan',
   'group': 'Amino Acids'},
  {'value': 0.896,
   'units': 'g',
   'description': 'Threonine',
   'group': 'Amino Acids'},
  {'value': 1.563,
   'units': 'g',
   'description': 'Isoleucine',
   'group': 'Amino Acids'},
  {'value': 2.412,
   'units': 'g',
   'description': 'Leucine',
   'group': 'Amino Acids'},
  {'value': 2.095,
   'units': 'g',
   'description': 'Lysine',
   'group': 'Amino Acids'},
  {'value': 0.659,
   'units': 'g',
   'description': 'Methionine',
   'group': 'Amino Acids'},
  {'value': 0.126,
   'units': 'g',
   'description': 'Cystine',
   'group': 'Amino Acids'},
  {'value': 1.326,
   'units': 'g',
   'description': 'Phenylalanine',
   'group': 'Amino Acids'},
  {'value': 1.216,
   'units': 'g',
   'description': 'Tyrosine',
   'group': 'Amino Acids'},
  {'value': 1.682,
   'units': 'g',
   'description': 'Valine',
   'group': 'Amino Acids'},
  {'value': 0.952,
   'units': 'g',
   'description': 'Arginine',
   'group': 'Amino Acids'},
  {'value': 0.884,
   'units': 'g',
   'description': 'Histidine',
   'group': 'Amino Acids'},
  {'value': 0.711,
   'units': 'g',
   'description': 'Alanine',
   'group': 'Amino Acids'},
  {'value': 1.618,
   'units': 'g',
   'description': 'Aspartic acid',
   'group': 'Amino Acids'},
  {'value': 6.16,
   'units': 'g',
   'description': 'Glutamic acid',
   'group': 'Amino Acids'},
  {'value': 0.439,
   'units': 'g',
   'description': 'Glycine',
   'group': 'Amino Acids'},
  {'value': 2.838,
   'units': 'g',
   'description': 'Proline',
   'group': 'Amino Acids'},
  {'value': 1.472,
   'units': 'g',
   'description': 'Serine',
   'group': 'Amino Acids'},
  {'value': 25.18,
   'units': 'g',
   'description': 'Protein',
   'group': 'Composition'},
  {'value': 29.2,
   'units': 'g',
   'description': 'Total lipid (fat)',
   'group': 'Composition'},
  {'value': 3.06,
   'units': 'g',
   'description': 'Carbohydrate, by difference',
   'group': 'Composition'},
  {'value': 3.28, 'units': 'g', 'description': 'Ash', 'group': 'Other'},
  {'value': 376.0,
   'units': 'kcal',
   'description': 'Energy',
   'group': 'Energy'},
  {'value': 39.28,
   'units': 'g',
   'description': 'Water',
   'group': 'Composition'},
  {'value': 1573.0, 'units': 'kJ', 'description': 'Energy', 'group': 'Energy'},
  {'value': 0.0,
   'units': 'g',
   'description': 'Fiber, total dietary',
   'group': 'Composition'},
  {'value': 673.0,
   'units': 'mg',
   'description': 'Calcium, Ca',
   'group': 'Elements'},
  {'value': 0.64,
   'units': 'mg',
   'description': 'Iron, Fe',
   'group': 'Elements'},
  {'value': 22.0,
   'units': 'mg',
   'description': 'Magnesium, Mg',
   'group': 'Elements'},
  {'value': 490.0,
   'units': 'mg',
   'description': 'Phosphorus, P',
   'group': 'Elements'},
  {'value': 93.0,
   'units': 'mg',
   'description': 'Potassium, K',
   'group': 'Elements'},
  {'value': 690.0,
   'units': 'mg',
   'description': 'Sodium, Na',
   'group': 'Elements'},
  {'value': 2.94,
   'units': 'mg',
   'description': 'Zinc, Zn',
   'group': 'Elements'},
  {'value': 0.024,
   'units': 'mg',
   'description': 'Copper, Cu',
   'group': 'Elements'},
  {'value': 0.021,
   'units': 'mg',
   'description': 'Manganese, Mn',
   'group': 'Elements'},
  {'value': 14.5,
   'units': 'mcg',
   'description': 'Selenium, Se',
   'group': 'Elements'},
  {'value': 1054.0,
   'units': 'IU',
   'description': 'Vitamin A, IU',
   'group': 'Vitamins'},
  {'value': 262.0,
   'units': 'mcg',
   'description': 'Retinol',
   'group': 'Vitamins'},
  {'value': 271.0,
   'units': 'mcg_RAE',
   'description': 'Vitamin A, RAE',
   'group': 'Vitamins'},
  {'value': 0.0,
   'units': 'mg',
   'description': 'Vitamin C, total ascorbic acid',
   'group': 'Vitamins'},
  {'value': 0.031,
   'units': 'mg',
   'description': 'Thiamin',
   'group': 'Vitamins'},
  {'value': 0.45,
   'units': 'mg',
   'description': 'Riboflavin',
   'group': 'Vitamins'},
  {'value': 0.18, 'units': 'mg', 'description': 'Niacin', 'group': 'Vitamins'},
  {'value': 0.19,
   'units': 'mg',
   'description': 'Pantothenic acid',
   'group': 'Vitamins'},
  {'value': 0.074,
   'units': 'mg',
   'description': 'Vitamin B-6',
   'group': 'Vitamins'},
  {'value': 18.0,
   'units': 'mcg',
   'description': 'Folate, total',
   'group': 'Vitamins'},
  {'value': 0.27,
   'units': 'mcg',
   'description': 'Vitamin B-12',
   'group': 'Vitamins'},
  {'value': 0.0,
   'units': 'mcg',
   'description': 'Folic acid',
   'group': 'Vitamins'},
  {'value': 18.0,
   'units': 'mcg',
   'description': 'Folate, food',
   'group': 'Vitamins'},
  {'value': 18.0,
   'units': 'mcg_DFE',
   'description': 'Folate, DFE',
   'group': 'Vitamins'},
  {'value': 0.324,
   'units': 'g',
   'description': 'Tryptophan',
   'group': 'Amino Acids'},
  {'value': 0.896,
   'units': 'g',
   'description': 'Threonine',
   'group': 'Amino Acids'},
  {'value': 1.563,
   'units': 'g',
   'description': 'Isoleucine',
   'group': 'Amino Acids'},
  {'value': 2.412,
   'units': 'g',
   'description': 'Leucine',
   'group': 'Amino Acids'},
  {'value': 2.095,
   'units': 'g',
   'description': 'Lysine',
   'group': 'Amino Acids'},
  {'value': 0.659,
   'units': 'g',
   'description': 'Methionine',
   'group': 'Amino Acids'},
  {'value': 0.126,
   'units': 'g',
   'description': 'Cystine',
   'group': 'Amino Acids'},
  {'value': 1.326,
   'units': 'g',
   'description': 'Phenylalanine',
   'group': 'Amino Acids'},
  {'value': 1.216,
   'units': 'g',
   'description': 'Tyrosine',
   'group': 'Amino Acids'},
  {'value': 1.682,
   'units': 'g',
   'description': 'Valine',
   'group': 'Amino Acids'},
  {'value': 0.952,
   'units': 'g',
   'description': 'Arginine',
   'group': 'Amino Acids'},
  {'value': 0.884,
   'units': 'g',
   'description': 'Histidine',
   'group': 'Amino Acids'},
  {'value': 0.711,
   'units': 'g',
   'description': 'Alanine',
   'group': 'Amino Acids'},
  {'value': 1.618,
   'units': 'g',
   'description': 'Aspartic acid',
   'group': 'Amino Acids'},
  {'value': 6.16,
   'units': 'g',
   'description': 'Glutamic acid',
   'group': 'Amino Acids'},
  {'value': 0.439,
   'units': 'g',
   'description': 'Glycine',
   'group': 'Amino Acids'},
  {'value': 2.838,
   'units': 'g',
   'description': 'Proline',
   'group': 'Amino Acids'},
  {'value': 1.472,
   'units': 'g',
   'description': 'Serine',
   'group': 'Amino Acids'},
  {'value': 93.0,
   'units': 'mg',
   'description': 'Cholesterol',
   'group': 'Other'},
  {'value': 18.584,
   'units': 'g',
   'description': 'Fatty acids, total saturated',
   'group': 'Other'},
  {'value': 8.275,
   'units': 'g',
   'description': 'Fatty acids, total monounsaturated',
   'group': 'Other'},
  {'value': 0.83,
   'units': 'g',
   'description': 'Fatty acids, total polyunsaturated',
   'group': 'Other'},
  {'value': 25.18,
   'units': 'g',
   'description': 'Protein',
   'group': 'Composition'},
  {'value': 29.2,
   'units': 'g',
   'description': 'Total lipid (fat)',
   'group': 'Composition'},
  {'value': 3.06,
   'units': 'g',
   'description': 'Carbohydrate, by difference',
   'group': 'Composition'},
  {'value': 3.28, 'units': 'g', 'description': 'Ash', 'group': 'Other'},
  {'value': 376.0,
   'units': 'kcal',
   'description': 'Energy',
   'group': 'Energy'},
  {'value': 39.28,
   'units': 'g',
   'description': 'Water',
   'group': 'Composition'},
  {'value': 1573.0, 'units': 'kJ', 'description': 'Energy', 'group': 'Energy'},
  {'value': 0.0,
   'units': 'g',
   'description': 'Fiber, total dietary',
   'group': 'Composition'},
  {'value': 673.0,
   'units': 'mg',
   'description': 'Calcium, Ca',
   'group': 'Elements'},
  {'value': 0.64,
   'units': 'mg',
   'description': 'Iron, Fe',
   'group': 'Elements'},
  {'value': 22.0,
   'units': 'mg',
   'description': 'Magnesium, Mg',
   'group': 'Elements'},
  {'value': 490.0,
   'units': 'mg',
   'description': 'Phosphorus, P',
   'group': 'Elements'},
  {'value': 93.0,
   'units': 'mg',
   'description': 'Potassium, K',
   'group': 'Elements'},
  {'value': 690.0,
   'units': 'mg',
   'description': 'Sodium, Na',
   'group': 'Elements'},
  {'value': 2.94,
   'units': 'mg',
   'description': 'Zinc, Zn',
   'group': 'Elements'},
  {'value': 0.024,
   'units': 'mg',
   'description': 'Copper, Cu',
   'group': 'Elements'},
  {'value': 0.021,
   'units': 'mg',
   'description': 'Manganese, Mn',
   'group': 'Elements'},
  {'value': 14.5,
   'units': 'mcg',
   'description': 'Selenium, Se',
   'group': 'Elements'},
  {'value': 1054.0,
   'units': 'IU',
   'description': 'Vitamin A, IU',
   'group': 'Vitamins'},
  {'value': 262.0,
   'units': 'mcg',
   'description': 'Retinol',
   'group': 'Vitamins'},
  {'value': 271.0,
   'units': 'mcg_RAE',
   'description': 'Vitamin A, RAE',
   'group': 'Vitamins'},
  {'value': 0.0,
   'units': 'mg',
   'description': 'Vitamin C, total ascorbic acid',
   'group': 'Vitamins'},
  {'value': 0.031,
   'units': 'mg',
   'description': 'Thiamin',
   'group': 'Vitamins'},
  {'value': 0.45,
   'units': 'mg',
   'description': 'Riboflavin',
   'group': 'Vitamins'},
  {'value': 0.18, 'units': 'mg', 'description': 'Niacin', 'group': 'Vitamins'},
  {'value': 0.19,
   'units': 'mg',
   'description': 'Pantothenic acid',
   'group': 'Vitamins'},
  {'value': 0.074,
   'units': 'mg',
   'description': 'Vitamin B-6',
   'group': 'Vitamins'},
  {'value': 18.0,
   'units': 'mcg',
   'description': 'Folate, total',
   'group': 'Vitamins'},
  {'value': 0.27,
   'units': 'mcg',
   'description': 'Vitamin B-12',
   'group': 'Vitamins'},
  {'value': 0.0,
   'units': 'mcg',
   'description': 'Folic acid',
   'group': 'Vitamins'},
  {'value': 18.0,
   'units': 'mcg',
   'description': 'Folate, food',
   'group': 'Vitamins'},
  {'value': 18.0,
   'units': 'mcg_DFE',
   'description': 'Folate, DFE',
   'group': 'Vitamins'},
  {'value': 0.324,
   'units': 'g',
   'description': 'Tryptophan',
   'group': 'Amino Acids'},
  {'value': 0.896,
   'units': 'g',
   'description': 'Threonine',
   'group': 'Amino Acids'},
  {'value': 1.563,
   'units': 'g',
   'description': 'Isoleucine',
   'group': 'Amino Acids'},
  {'value': 2.412,
   'units': 'g',
   'description': 'Leucine',
   'group': 'Amino Acids'},
  {'value': 2.095,
   'units': 'g',
   'description': 'Lysine',
   'group': 'Amino Acids'},
  {'value': 0.659,
   'units': 'g',
   'description': 'Methionine',
   'group': 'Amino Acids'},
  {'value': 0.126,
   'units': 'g',
   'description': 'Cystine',
   'group': 'Amino Acids'},
  {'value': 1.326,
   'units': 'g',
   'description': 'Phenylalanine',
   'group': 'Amino Acids'},
  {'value': 1.216,
   'units': 'g',
   'description': 'Tyrosine',
   'group': 'Amino Acids'},
  {'value': 1.682,
   'units': 'g',
   'description': 'Valine',
   'group': 'Amino Acids'},
  {'value': 0.952,
   'units': 'g',
   'description': 'Arginine',
   'group': 'Amino Acids'},
  {'value': 0.884,
   'units': 'g',
   'description': 'Histidine',
   'group': 'Amino Acids'},
  {'value': 0.711,
   'units': 'g',
   'description': 'Alanine',
   'group': 'Amino Acids'},
  {'value': 1.618,
   'units': 'g',
   'description': 'Aspartic acid',
   'group': 'Amino Acids'},
  {'value': 6.16,
   'units': 'g',
   'description': 'Glutamic acid',
   'group': 'Amino Acids'},
  {'value': 0.439,
   'units': 'g',
   'description': 'Glycine',
   'group': 'Amino Acids'},
  {'value': 2.838,
   'units': 'g',
   'description': 'Proline',
   'group': 'Amino Acids'},
  {'value': 1.472,
   'units': 'g',
   'description': 'Serine',
   'group': 'Amino Acids'},
  {'value': 93.0,
   'units': 'mg',
   'description': 'Cholesterol',
   'group': 'Other'},
  {'value': 18.584,
   'units': 'g',
   'description': 'Fatty acids, total saturated',
   'group': 'Other'},
  {'value': 8.275,
   'units': 'g',
   'description': 'Fatty acids, total monounsaturated',
   'group': 'Other'},
  {'value': 0.83,
   'units': 'g',
   'description': 'Fatty acids, total polyunsaturated',
   'group': 'Other'}]}